#+TITLE: DM1 Week 05 Prepare and Teach
#+LANGUAGE: en
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+OPTIONS: html-postamble:nil
#+STARTUP: showeverything entitiespretty
#+SETUPFILE: ../theme-bigblow.setup
#+BEGIN: clocktable :maxlevel 2 :scope file
#+CAPTION: Clock summary at [2018-02-15 Thu 22:47]
| Headline                                 |   Time |      |
|------------------------------------------+--------+------|
| *Total time*                             | *2:51* |      |
|------------------------------------------+--------+------|
| Prepare                                  |   0:38 |      |
| \_  Answer What is True By Way of Review |        | 0:13 |
| \_  Read A Quote About Combinatorics     |        | 0:04 |
| \_  Answer What is True                  |        | 0:21 |
| Teach                                    |   2:13 |      |
#+END:

* Instructions
  See [[file:../week00/00-ponder--prove.org]]

* Important!! README Important!!
  The first part, *Prepare*, is due before class on Thursday, February
  15th, 2018. That means added, committed, and pushed.

  *Coming to class unprepared is bad for you!*
  - Duly noted.

* DONE Prepare
  CLOSED: [2018-02-15 Thu 22:47]
** DONE Answer What is True By Way of Review
   CLOSED: [2018-02-09 Fri 14:12]
   :LOGBOOK:
   CLOCK: [2018-02-09 Fri 13:59]--[2018-02-09 Fri 14:12] =>  0:13
   :END:
  You know what to do:
  - [X] I know that xRy is a shorthand notation for \ldquo{}x is related to y\rdquo (under
    relation R).
    (x, y) \in R
  - [X] I know that A \times B, the *Cartesian product* (or just product) of set A
    with set B is the set of all ordered pairs (a b) where a \in A and b \in B.
    
  - [X] I think I understand how the *Cartesian Product* generalizes to *n*
    sets.
  - [X] I can match the name on the left with the correct definition of a type
    of relation on the right:
  | 1. *Reflexive*     - d. | a. \forall x \forall y [xRy \rightarrow yRx]           |
  | 2. *Symmetric*     - a. | b. \forall x \forall y [xRy \land yRx \rightarrow x = y]   |
  | 3. *Antisymmetric* - b. | c. \forall x \forall y \forall z [xRy \land yRz \rightarrow xRz] |
  | 4. *Transitive*    - c. | d. \forall x [x \in U \rightarrow xRx]             |
  - [X] I chose the correct matching as one of the following lisp lists of \ldquo{}dotted pairs\rdquo:
  - [ ] ((1 . a) (2 . b) (3 . c) (4 . d))
  - [ ] ((1 . a) (2 . b) (3 . d) (4 . c))
  - [ ] ((1 . a) (2 . c) (3 . b) (4 . d))
  - [ ] ((1 . a) (2 . c) (3 . d) (4 . b))
  - [ ] ((1 . a) (2 . d) (3 . b) (4 . c))
  - [ ] ((1 . a) (2 . d) (3 . c) (4 . b))
  - [ ] ((1 . b) (2 . a) (3 . c) (4 . d))
  - [ ] ((1 . b) (2 . a) (3 . d) (4 . c))
  - [ ] ((1 . b) (2 . c) (3 . a) (4 . d))
  - [ ] ((1 . b) (2 . c) (3 . d) (4 . a))
  - [ ] ((1 . b) (2 . d) (3 . a) (4 . c))
  - [ ] ((1 . b) (2 . d) (3 . c) (4 . a))
  - [ ] ((1 . c) (2 . a) (3 . b) (4 . d))
  - [ ] ((1 . c) (2 . a) (3 . d) (4 . b))
  - [ ] ((1 . c) (2 . b) (3 . a) (4 . d))
  - [ ] ((1 . c) (2 . b) (3 . d) (4 . a))
  - [ ] ((1 . c) (2 . d) (3 . a) (4 . b))
  - [ ] ((1 . c) (2 . d) (3 . b) (4 . a))
  - [X] ((1 . d) (2 . a) (3 . b) (4 . c))
  - [ ] ((1 . d) (2 . a) (3 . c) (4 . b))
  - [ ] ((1 . d) (2 . b) (3 . a) (4 . c))
  - [ ] ((1 . d) (2 . b) (3 . c) (4 . a))
  - [ ] ((1 . d) (2 . c) (3 . a) (4 . b))
  - [ ] ((1 . d) (2 . c) (3 . b) (4 . a))

** DONE Read A Quote About Combinatorics 
   CLOSED: [2018-02-09 Fri 14:16]
   :LOGBOOK:
   CLOCK: [2018-02-09 Fri 14:12]--[2018-02-09 Fri 14:16] =>  0:04
   :END:
  --- and the other quotes --- and then answer the questions.

#+BEGIN_QUOTE
  Combinatorics is a branch of mathematics dealing with problems of combining
  objects, or sorting them into categories. It originated in the study of
  probability by Pierre de Fermat, Blaise Pascal, and other 17^{th}-century
  mathematicians, who were inspired not by the beauty of the math but by a very
  practical concern: they wanted to calculate the odds associated with gambling.

  During the 18^{th} and 19^{th} centuries, combinatorics was something of a
  mathematical backwater. Its association with gambling accounted in part for
  its lack of status, but more fundamental forces were also in play.
  Combinatorics deals with discrete entities, like the cards in a deck or socks
  in a drawer. But most of the important problems being investigated by
  mathematicians at that time involved continuous entities, like lines or
  surfaces. Mathematicians developed many general techniques to analyze such
  problems, particularly the methods of calculus.

  They found far fewer general techniques to analyze problems involving discrete
  entities, because discrete objects can have so many different properties and
  can be arranged in so many different ways. Each problem has to be broken down
  into its constituent pieces, from which a useful pattern may or may not
  emerge.

  In the 20^{th} century combinatorics staged a major comeback for one overriding
  reason: the invention of electronic computers. The objects manipulated by
  computers are discrete, not continuous. They are the 1s and 0s of on-off
  switches, not the smooth curves of continuous surfaces. To analyze the
  capabilities of computers, mathematicians had to develop new ways of dealing
  with noncontinuous objects, and that need reinvigorated the field of
  combinatorics.

  --- Steve Olson
#+END_QUOTE

  Steve Olson has a lot more to say about the uses of combinatorics that we will
  consider later. For now, consider this: 

  1. You know (or should) that there are rules of logic that underlie the rules
     for counting.
  2. Are there also rules for being creative?
  3. Or is that a contradiction in terms?
  4. When you need to find answers, do you find yourself using the rule /Google
     it!/ a lot?

  Try it on the following two short quotes. Who said the following?

#+BEGIN_QUOTE
  If you obey all the rules you miss all the fun!
#+END_QUOTE

#+BEGIN_QUOTE
  No right, no wrong, no rules for me. I’m free!
#+END_QUOTE 

  How about this one?

#+BEGIN_VERSE
  Logicians have but ill defin’d,
  As rational the human kind;
  Reason, they say, belongs to man,
  But let them prove it if they can.
#+END_VERSE

  The human kind is indeed expert at rationalizing! How reasonable we all are!

#+BEGIN_QUOTE
  So convenient a thing it is to be a reasonable creature, since it enables one
  to find or make a reason for every thing one has a mind to do.
#+END_QUOTE

#+BEGIN_QUOTE
  Good sense is the most equitably distributed of all things because no matter
  how much or little a person has, everyone feels so abundantly provided with
  good sense that he feels no desire for more than he already possesses.
#+END_QUOTE

** DONE Answer What is True
   CLOSED: [2018-02-09 Fri 14:37]
   :LOGBOOK:
   CLOCK: [2018-02-09 Fri 14:16]--[2018-02-09 Fri 14:37] =>  0:21
   :END:
  You know what to do:
  - [X] I found and entered below the author of the first short quote, \ldquo{}If you \dots\rdquo.
  - [X] I found and entered below the author of the second short quote, \ldquo{}No right, \dots\rdquo.
  - [X] I found and entered below the author of the third short quote, \ldquo{}Logicians have \dots\rdquo.
  - [X] I found and entered below the author of the fourth short quote, \ldquo{}So convenient \dots\rdquo.
  - [X] I found and entered below the author of the fifth short quote, \ldquo{}Good sense \dots\rdquo.
  - [X] I watched Terry Moore’s TED talk /Why is ‘x’ the unknown?/.
  - [X] I know why \lsquo{}x\rsquo is the unknown.
    (You can't say shhh in Spanish)

  Enter the author(s) you found (and where) in the table below:

  | Which? | Author of Quote        | Where Found (link to website)                                                                     |
  |--------+------------------------+---------------------------------------------------------------------------------------------------|
  | First  | Katharine Hepburn      | https://www.goodreads.com/author/quotes/84099.Katharine_Hepburn                                   |
  | Second | Elsa - Frozen (Disney) | http://sites.nd.edu/oblation/2014/10/27/letting-go-of-let-it-go-the-deeper-truths-of-frozen/      |
  | Third  | Jonathan Swift         | http://www.online-literature.com/swift/3490/                                                      |
  | Fourth | Benjamin Franklin      | https://www.goodreads.com/quotes/46392-so-convenient-a-thing-to-be-a-reasonable-creature-since    |
  | Fifth  | René Descartes         | https://www.goodreads.com/quotes/48764-good-sense-is-the-most-equitably-distributed-of-all-things |
  | Sixth  | Terry Moore            | https://www.ted.com/talks/terry_moore_why_is_x_the_unknown                                        |

* DONE Teach
  CLOSED: [2018-02-15 Thu 22:46]
  :LOGBOOK:
  CLOCK: [2018-02-15 Thu 12:45]--[2018-02-15 Thu 13:49] =>  1:04
  CLOCK: [2018-02-13 Tue 12:38]--[2018-02-13 Tue 13:47] =>  1:09
  :END:
  Think about and come prepared to discuss with your group (old or new) how to
  compute the probability that a verse randomly chosen from the verses in the
  Book of Mormon that contain the words heed and diligence in close proximity will
  have those two words in alphabetical order.

  What the words heed and diligence are will be revealed in class.

#+BEGIN_SRC python :results output
count_close = 0
count_alphabetical = 0
for i in verses_containing(heed, diligence):
  count_close += 1
  verse = i.split
  index_heed = 0
  index_dil = 0
  for j in verse:
    if j == "diligence":
      index_dil = verse[j]
    elif j == "heed":
      index_heed = verse[j]
  if index_dil < index_heed:
    count_alphabetical += 1

probability = count_alphabetical/count_close
print("Probability:",probability)
#+END_SRC

In same verse probability = 3/6 = 50% probability
Within a word probability = 2/5 = 40% probability

